---
kind: method
id: M:Autodesk.Revit.DB.Electrical.PanelScheduleView.RenumberIndexes
source: html/a85d24c0-1161-ee9e-9a08-e5d2d244f531.htm
---
# Autodesk.Revit.DB.Electrical.PanelScheduleView.RenumberIndexes Method

Renumbers the Circuit Naming Index for the circuits in the panel.

## Syntax (C#)
```csharp
public void RenumberIndexes()
```